[
  {
    "id": "startStopButton",
    "description": "This button starts and stops kancolle auto and brings the console to front if it's open"
  },
  {
    "id": "profileLabel",
    "description": "The profile that is currently loaded.\n\nTIP: To rename a profile, delete it first then change the name and save"
  },
  {
    "id": "General-programLabel",
    "description": "The program/window name of your Kancolle container. Eg. Google Chrome, Firefox, KanColleViewer!, KanColleTool Viewer, Electronic Observer, etc."
  },
  {
    "id": "General-recoveryMethodLabel",
    "description": "Which built-in recovery method to use when you get cat bombed"
  },
  {
    "id": "General-basicRecoveryLabel",
    "description": "Check this box if your viewer sometimes throws a popup that must be cleared (DMM popup, KC3Kai navigation warning popup due to KC3Kai updates, etc). Setting this to True will try hitting the Esc key to clear the popup before re-initializing kancolle-auto from the beginning. Unfortunately does not work if the game is mid-sortie/combat"
  },
  {
    "id": "General-paranoiaLabel",
    "description": "Specifies the desired # of menus to randomly walk through. The number of sidesteps range from 0 to the Paranoia value. Setting this value to at least 1 is recommended (0 to 1 sidesteps)"
  },
  {
    "id": "General-sleepCycleLabel",
    "description": "How often kancolle-auto should run its loop, specified in full seconds. A lower value will make kancolle-auto be quicker to respond to timers, while a higher value will make it slower, but perhaps guard against bot-detection"
  },
  {
    "id": "General-sleepModifierLabel",
    "description": "If you have a slow computer/network connection, you may encounter frequent FindFailed errors. Increase this value by whole numbers (seconds) to increase the length of all sleep/wait timers to avoid this"
  },
  {
    "id": "Scheduling-enableSleepButton",
    "description": "Check this box if you want kancolle-auto to automatically sleep/pause at set times. Highly recommended that you check this box if you run kancolle-auto for a long period of time"
  },
  {
    "id": "Scheduling-startTimeLabel",
    "description": "Define around when you would like scheduled sleep to start. (Based on computer local time)"
  },
  {
    "id": "Scheduling-sleepLengthLabel",
    "description": "How long you want the sleep to last, in hours. Anywhere between 0 to 10 minutes are added randomly to the actual timer"
  },
  {
    "id": "Scheduling-enableAutoStopButton",
    "description": "Set to True if you want kancolle-auto to automatically stop and exit after a set number of hours, expeditions, sorties, or PvPs. You will have to manually restart kancolle-auto after this"
  },
  {
    "id": "Scheduling-modeLabel",
    "description": "Define what you want to base the stop count on"
  },
  {
    "id": "Scheduling-countLabel",
    "description": "Define how many of the above kancolle-auto should perform before automatically stopping"
  },
  {
    "id": "Sortie-enableButton",
    "description": "Check this box if you want to enable sorties"
  },
  {
    "id": "Sortie-engineLabel",
    "description": "Legacy: Per node definition of formations and night battles, low CPU usage.\n\nLive / Dynamic: Auto node detection with optional formation and night battle overrides, high CPU usages"
  },
  {
    "id": "Sortie-fleetModeLabel",
    "description": "Type of fleet the script should sortie"
  },
  {
    "id": "Sortie-mapLabel",
    "description": "The map the script should sortie the fleet"
  },
  {
    "id": "Sortie-nodesLabel",
    "description": "Maximum number of combat nodes to run. Resource/hazard nodes do not count"
  },
  {
    "id": "Sortie-nodeSelectsLabel",
    "description": "Specify which nodes to choose when the script arrives at a branch"
  },
  {
    "id": "Sortie-formationsLabel",
    "description": "Formations to use at each combat node"
  },
  {
    "id": "Sortie-nightBattlesLabel",
    "description": "Whether or not to engage in night battle at each combat node"
  },
  {
    "id": "Sortie-retreatLimitLabel",
    "description": "Specifies the damage level (of any ship) in which to retreat from a sortie"
  },
  {
    "id": "Sortie-repairLimitLabel",
    "description": "Specifies the damage level (of any ship) to repair before sortieing again. The script will not sortie if any ships are at in this damage level"
  },
  {
    "id": "Sortie-repairTimeLimitLabel",
    "description": "Set the repair time limit for repairs. kancolle-auto will automatically use a bucket to repair a ship if its repair time is above this # of hours"
  },
  {
    "id": "Sortie-checksLabel",
    "description": "Several options that are checked before and after sortieing"
  },
  {
    "id": "Sortie-reserveDocksCheckBox",
    "description": "Reserves a single dock when trying to repair ships, useful for preventing repairs from blocking continuous sorties but may increase bucket usage"
  },
  {
    "id": "Sortie-checkFatigueCheckBox",
    "description": "Whether or not to consider fatigue/morale before sorties. If the ships have an unhappy face (morale of 29 or below) the script will wait for a set amount of time for morale to recover"
  },
  {
    "id": "Sortie-checkPortCheckBox",
    "description": "Whether or not to sortie when the port (ship slots) is full. Check this box if you do not want sorties to occur when your port is full. Port checking is automatically done when sortieing to Event maps, since sortieing is prohibited when you do not have 5 free ship slots"
  },
  {
    "id": "Sortie-medalStopCheckBox",
    "description": "Set this to True if you want kancolle-auto to stop sortieing to the specified map once the medal has been obtained. Only applicable to the monthly EOs (1-5, 2-5, 3-5, 4-5, 5-5)"
  },
  {
    "id": "Sortie-lastNodePushLabel",
    "description": "Set whether or not to 'push' past the max number of defined combat nodes, REGARDLESS OF THE STATE OF YOUR FLEET. Only do this if the last node is a resource/non-combat node, like the end of 1-6, and only if your path is 100% fixed!\n\nWARNING: YOU MAY LOSE SHIPS WITH THIS SET TO TRUE. PLEASE STUDY THE MAP YOU ARE SORTIEING TO AND MAKE AN EDUCATED DECISION"
  },
  {
    "id": "PvP-enableButton",
    "description": "Check this box if you want to enable pvp"
  },
  {
    "id": "PvP-fleetCompLabel",
    "description": "Specify which saved fleet composition should be used for pvp, with the first saved fleet being 1.\n\nNOTE: this value is only relevant if both PvP and Combat modules are enabled with different fleets assigned to them!"
  },
  {
    "id": "Expeditions-enableButton",
    "description": "Check this box if you want to enable expeditions"
  },
  {
    "id": "Expeditions-fleet2Label",
    "description": "The expeditions fleet 2 should go on. If this Fleet hasn't been unlocked or you don't want it to run an expedition, just leave it empty"
  },
  {
    "id": "Expeditions-fleet3Label",
    "description": "The expeditions fleet 3 should go on. If this Fleet hasn't been unlocked or you don't want it to run an expedition, just leave it empty"
  },
  {
    "id": "Expeditions-fleet4Label",
    "description": "The expeditions fleet 4 should go on. If this Fleet hasn't been unlocked or you don't want it to run an expedition, just leave it empty"
  },
  {
    "id": "Quests-enableButton",
    "description": "Check this box if you want kancolle auto to manage quests"
  },
  {
    "id": "Quests-questsLabel",
    "description": "Quests to check for, only the shown quests are supported. Kancolle-auto will ignore quests if they are not completable as specified by your config (if PvP is disabled, PvP quests will not be activated, and so on)"
  },
  {
    "id": "Quests-checkScheduleLabel",
    "description": "How often should quests be checked? Settings this to 1 will make quests be checked after every expedition and sortie"
  },
  {
    "id": "LBAS-lbasGroup1Label",
    "description": "Which nodes to send LBAS group 1 to, only enabled if 2 nodes are specified"
  },
  {
    "id": "LBAS-lbasGroup2Label",
    "description": "Which nodes to send LBAS group 2 to, only enabled if 2 nodes are specified"
  },
  {
    "id": "LBAS-lbasGroup3Label",
    "description": "Which nodes to send LBAS group 3 to, only enabled if 2 nodes are specified"
  },
  {
    "id": "Preferences-preventLockLabel",
    "description": "Prevent computer from activating lockscreen when kancolle auto is active, useful when you set kancolle auto to only expeditions and it idles longer than your lockscreen activation time, otherwise kancolle auto crashes when your computer locks itself"
  },
  {
    "id": "Preferences-clearConsoleLabel",
    "description": "Clears console before a new session is started if enabled"
  },
  {
    "id": "Preferences-restartSessionLabel",
    "description": "If enabled and Kancolle Auto crashes for some reason, KAGA will automatically spawn a new session"
  },
  {
    "id": "Preferences-maxRetriesLabel",
    "description": "Number of retries KAGA should try to restart the script"
  },
  {
    "id": "Preferences-enableDebugModeLabel",
    "description": "Prints out useful information about the internal state of KAGA, letting you get a clearer picture of what's happening if enabled"
  },
  {
    "id": "Preferences-showDebugLabel",
    "description": "Automatically opens the debug console on the start of KAGA if enabled"
  },
  {
    "id": "Preferences-showStatsLabel",
    "description": "Automatically opens the stats window on the start of KAGA if enabled"
  },
  {
    "id": "Preferences-checkForUpdatesLabel",
    "description": "Checks for KAGA updates on startup if enabled"
  },
  {
    "id": "Preferences-sikuliScriptJarLabel",
    "description": "Path to the sikuli script Jar"
  },
  {
    "id": "Preferences-kcaKaiRootLabel",
    "description": "Path to kcauto-kai root directory"
  },
  {
    "id": "ShipSwitcher-enableButton",
    "description": "Check this box if you want ships to be switched around"
  },
  {
    "id": "ShipSwitcher-slot1CriteriaLabel",
    "description": "Criteria for ship in slot 1 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot2CriteriaLabel",
    "description": "Criteria for ship in slot 2 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot3CriteriaLabel",
    "description": "Criteria for ship in slot 3 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot4CriteriaLabel",
    "description": "Criteria for ship in slot 4 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot5CriteriaLabel",
    "description": "Criteria for ship in slot 5 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot6CriteriaLabel",
    "description": "Criteria for ship in slot 6 to be eligible to be switched out"
  },
  {
    "id": "ShipSwitcher-slot1ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 1"
  },
  {
    "id": "ShipSwitcher-slot2ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 2"
  },
  {
    "id": "ShipSwitcher-slot3ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 3"
  },
  {
    "id": "ShipSwitcher-slot4ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 4"
  },
  {
    "id": "ShipSwitcher-slot5ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 5"
  },
  {
    "id": "ShipSwitcher-slot6ShipsLabel",
    "description": "Criteria for what kind of ships are eligible to be switched into slot 6"
  }
]
